
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"abc61adac0c8298342ca03122d3fb1ae87c6aa4c084e9ce3c08ce558c45d919f\"" -> "W/\"f593cb117d974d129c1b8251cc9f5d83aa9e59d4758668ace7eb0fcd9b7e7742\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"06c9287defa4fa22623e7c18aa71ce2aed3e52d856e37989d2a0880f393bac7c\"" -> "W/\"758a45662551540aec9c3f42373922b9b34d80e6df285088e29ccb0cba83f5a7\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-docker"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"a10336315d3afceed675293c5b1684b76e54c8b9014120852967d36afb72b811\"" -> "W/\"1bdea73498f106c0ab621965d9354544f6cf9256cc40352fd1e5aa7150598e4e\""
        id                          = "kong-docker"
        name                        = "kong-docker"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"30af5a79d6e3990f61291b3736f4cc0e38ffcb6d8d1b98f3291a6d801e883718\"" -> "W/\"0d7157555d0ae2205ff3069e4a1026f456058b4fe9991d9ec934b675133d4500\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"be17e9333c20b7dd6d7d1a5f67c87668683f49db15759c0dc9fdd51f69533eb0\"" -> "W/\"d6ef704fc17483fb1a44a4125869a5f1cfe40d46dc81c86ead727fe21b31557e\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"ca82ad2d828c592fc4b348e39bd20f0cf841fb3452ab94fca110c0214fd06429\"" -> "W/\"f60d0448dba0b06cf904400fc4a808e308d3999141e09713a11dcdc940569af0\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"4491a71f5bda8bc1d9bdc971607453ae6972c2be9219e53be068afdf6272cd26\"" -> "W/\"441965319e1e4f6ba3197901ab2c34e236ef760de081a3b17c0a8327f0b38a77\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"8f3bf79e9e22df40e771c36adac8193676620fe6ee0a5d978d3f95cf342c90a7\"" -> "W/\"f039b5928fce0947a3eb31b0aaa22050737960c83cec3bb3c044724896d4fb6d\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9ac9902cfd7c05f4dd6a2c7ae1af803121fb7f3115de58815239f79cd6c1331b\"" -> "W/\"cb9394afcc1851b64a56111291f65757ecb6fbc0e6456f46efa36b9b896d1fa1\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"34b774805281525f03545b0cc49815cada87daf419156a81114985782abf0057\"" -> "W/\"269e92a429c0b075090c42fac02dca6e9b3d821e9748a6b28599d8679c27b32e\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"93bf682d1c612e318213ee685631a800a2c56027072864804c17d2a017947674\"" -> "W/\"be99e1349fb74ee59d85d168fcc0b875ca2a6363b96d19b934782be7f1c847e6\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"386f284f083088100edf7e9358eead73413bdc52cfc99a736fc6dd13ba6281ec\"" -> "W/\"84513891788225e3f6c367081c0130c005879cffdac2ad744321e6440a9b15e1\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4cd8b35dac3ef597e45d10ce2bece7bba361fa291aac6cdc5ab079b67893bb9c\"" -> "W/\"9ed7653b992e71deb7391df3d888ced3ea0f658d8c0a9d5443a338f941e898de\""
        id          = "1491043"
        name        = "protect-main-branch-kong-docker-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"79409102c3264bd04b3639a1eac488f654ba0f3fdd1d0b7a9beaab18966618bd\"" -> "W/\"7929eba50991839ccb033a4bc4a7b58bbda95d09907f04b2dabd12d72a6f6ce1\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"adada07e6b099a1614a501e75ea548dc8fd8c1d6689d232368b56ceed190789c\"" -> "W/\"ed1eb32688bb1602c59f036ab25d6c62c5311f6e64503e3b30dfef4d13673d36\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"a486901298c82643407639ae366d1acaf98799808fe22a3234c40420311929e0\"" -> "W/\"5e8cef75d6f9f83ea4602c15632033ca1dce1713e1bfff5298c8b03a84e35e88\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"272129748ae386d417b1cc8d3bcbc78e4eaab480c2cfe132e26687dc33396870\"" -> "W/\"bbe3665ab79c7ca335fb3bd6d08db147ed8ca421b6668a2cf4221638c63ccaaf\""
        id          = "1482348"
        name        = "protect-main-branch-kong-test-suite-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"eef5a5d2f7c03e24d4717d4ca5e578d4a0e96bb50be4c2427238e16ed114246d\"" -> "W/\"2d9065ff115c161c7e270ed83436e29749592157297bc95365f061a583550001\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"3de5c6bde9c791bf2c30f0528767d9accaabbd553a08a529c3e9dbc1da62f3b9\"" -> "W/\"f6b553dbdf92ade3f180038c905b8f825caf4ab1e0b27e689955cee6b9c3ad9b\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"89e084801f81e37ff75a47d55552f4fbf72cd41aa32c2c6d25668e5ae88f4958\"" -> "W/\"905748a6e02c0781d65d2accd03ad5d4ae4e5ccc7757d7206eff19ccdf1ecb08\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0cc109773a4a952299156bd88e92f338e78548f69f2510026ff649fb4e0f51ae\"" -> "W/\"d79235dfaa320b50639c87ba9fee8ea62347fd5c6884f849fe35ef4fdadf4672\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"70b94611554e35e6dbebbaae7b04bca1e53086435c054691631aa68086053fe7\"" -> "W/\"581acee2d0bd45738c044b263aa5e9d5923e061c558fd5a4455352460757f9d6\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"9291c26a860a1f538e228ae69b3071f91696ff64ed6c8c93d676f1b27dc57cda\"" -> "W/\"a09d9246de1dfe1b6dc991a4e06feab487a7220f6f0776f1e8bad2b6bd6ae440\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c55659af06a03070f1934415a6c2e575c4c65d331c09e8d5d675242196ca0da8\"" -> "W/\"7a9c422dd1c0450b9b87a436cbe0d6d442be73715f7abc12698a0b89b7ca3ec0\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"d36045be36a02455aca8f725f9f3d1a46c79f67d9af0604f4702ed20e15c0539\"" -> "W/\"c9379cb30c1adcbc171979f873919f72915356923b1aaa8805c6210355fa3e7c\""
        id          = "1491044"
        name        = "protect-main-branch-kong-docker-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"6240dfa006966f51cf607cde0d6eee12d8770f189cffd46fc73d7cf5991bc524\"" -> "W/\"dff406b328a9cf19330de734211cf46f578e02e3854922d30c07659a72679c7c\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"5a37e5a08e63eb805a368bbfe2e35ed8e4e05272bda191c7aa31e87206ccf38e\"" -> "W/\"8fb9c02ff5fc601731107e5fbda455166a9d79425a00151dd85c9a63d69aabf4\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"8e78fe1aaf93cd42809c1708a5d0e721c445b313a0e101708e950882d3a2ae31\"" -> "W/\"a65a73accc9c6bcd4a49041ae971b79e407d6969b57d576e53a3f8cdf9e185b0\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"23a1c54a1194f7d11e96152433d29ef74e6c27bcfb91b47c0ebc75b0840fdb79\"" -> "W/\"094a2f176d0502bc33fc2354f562bd7e3f0d44d8b445c2f1673d589ee18eba8e\""
        id          = "1482346"
        name        = "protect-main-branch-kong-test-suite-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"00934bc3aed93d9b687469037fa60e7ba6e135ef62ba3aa4431e075db66723d0\"" -> "W/\"c49794e882c9e0445eee85272bec2599e123e1dc52d6697154139b60957d4ac7\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"94c8d1bf729d0d635d87d9703b0d231c6c9890d23f80395fb7d81a2174b12784\"" -> "W/\"4ae5bbcd0de1174534af7b7e53998a1faa72ba3baf7ad61183e4c06951d1d730\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"2a3bf6f2df35fe4796cf10ec1d5ab0760334cbac90af3c2583c798d642f822cf\"" -> "W/\"24a784db65911715158a30426f09c32f103b393e1c293f4d7b6acbb3fba07f26\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"5e3661f2d9ed6b0b645724335b363be86086049899d850b7f5ab028ad4cd79c9\"" -> "W/\"4a2ecc5de9b00c82559e6d73981cc6fb1fab82eb5c3204891553a3c389f8601c\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240828-060850"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.settings_all["kong-test-suite"] will be destroyed
  # (because key ["kong-test-suite"] is not in for_each map)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"441965319e1e4f6ba3197901ab2c34e236ef760de081a3b17c0a8327f0b38a77\"" -> null
      - full_name                   = "gh-org-template/kong-test-suite" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-test-suite.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-test-suite" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-test-suite.git" -> null
      - id                          = "kong-test-suite" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "kong-test-suite" -> null
      - node_id                     = "R_kgDOMnA_cQ" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 846217073 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-test-suite.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-test-suite" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-template" -> null
        }
    }

  # github_repository.settings_private_all["kong-test-suite"] will be created
  + resource "github_repository" "settings_private_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-test-suite"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-template"
        }
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1491043"
      ~ name        = "protect-main-branch-kong-docker-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1482348"
      ~ name        = "protect-main-branch-kong-test-suite-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1491044"
      ~ name        = "protect-main-branch-kong-docker-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1482346"
      ~ name        = "protect-main-branch-kong-test-suite-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240828-060850" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 24 to change, 1 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->